code/security-ws/src/test/resources/org/jboss/fuse/security/encryption/soap_body_encrypted_italy_cheese.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Element"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:KeyValue><ds:RSAKeyValue><ds:Modulus>m6HrXV3XOe4SEG1n/R4ZjW8wGwnVbCayuQUoT7tFJwMEG6ehDXqDndypWrg6Yk0iqEAYghWLr0CiiyUKqZOhaQvy4rG9n4I1IlsF0Dzhly+HMSAUI0AHoTYBqduEB+Vz0Hoqecw0kBs50ASOq1izLq6ukeEgVu8nLRwXiNiQZqs=</ds:Modulus><ds:Exponent>AQAB</ds:Exponent></ds:RSAKeyValue></ds:KeyValue></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>eDTJ5fh8j54iGkAxr3ebrBwjU8+ZGFC7WTb55Q98CRCPsK0Uu84RxgAGIWtLIoF5Vz5xwTZOpuPBD70uNRkJTYY0jWUQIbC0AydJgafQzbNVGqbXvlXhIQmGt2KhzHIW03fy6NKfiCZDaExJ80UxoEFeW1xcQnCug6m2kpxeUBo=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>of3nuZmzWndEdsd91DJarKeUfgcTfoRoXJPvnphnEdqGHG6o6V9a/FArIibmSNcZhzl4iEKl0Xt17STZTjbN5bMmSl6ApI+MGjUFWvNRxLkskdwRmiJzGE8jsqYx7HBkUPjYYNG/90gzk9ezRrSRjpqRVvm6pJV+I7O2V4W11zOtMH3bgUIctLvsZnUgwka+8Amzrzp8rT2CWZWcvcnCFFDIpCXRjzuZHX3/1vvWeRI=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData>
    </soap:Body>
</soap:Envelope>